namespace BinaryCalc
{
    static class TCErrors
    {
        public static readonly string[] Err =
        {
            "Некорректный синтаксис идентификатора", // 0
            "Недопустимый символ в выражении", // 1
            "Некорректное положение идентификатора переменной", // 2
            "Знак = может следовать только после идентификатора", // 3
            "Пустое выражение", // 4
            "Выражение синтаксически не закончено", // 5
            "Для закрывающей скобки нет парной", // 6
            "Некорректное положение открывающей скобки", // 7
            "Некорректное положение закрывающей скобки", // 8
            "", // 9
            "", // 10
            "", // 11
            "", // 12
            "", // 13
            "", // 14
            "", // 15
            "", // 16
            "", // 17
            "", // 18
            "", // 19
            "", // 20
            "", // 21
            "", // 22
            "", // 23
        };
    }
}
